app/Controllers/AdminController.php

    public function index() {
        if (!session()->get('isLoggedIn')) return redirect()->to('/login');

        $data = [
            'page'     => 'products',
            'products' => $this->pModel->findAll(),
---
SELECT *
FROM `products`

    public function stock() {
        if (!session()->get('isLoggedIn')) return redirect()->to('/login');
        return view('admin/dashboard', ['page'=>'stock', 'products'=>$this->pModel->findAll()]);
---
SELECT *
FROM `products`

    public function sales() {
        if (!session()->get('isLoggedIn')) return redirect()->to('/login');
        return view('admin/dashboard', [
            'page'     => 'sales',
            'products' => $this->pModel->findAll(),
            'sales'    => $this->sModel->orderBy('id', 'DESC')->findAll()
---
SELECT *
FROM `products`
SELECT *
FROM `sales`
ORDER BY `id` DESC

    public function storeSale() {
        $productId = $this->request->getVar('product_id');
        $quantity  = (int) $this->request->getVar('quantity');

        if (!$productId || $quantity <= 0) {
            return redirect()->to('/admin/sales')->with('error', 'Invalid input.');
        }

        $product = $this->pModel->find($productId);

        if ($product) {
            if ($product['stock'] >= $quantity) {
                $totalPrice = $product['price'] * $quantity;

                // 1. Save Sale
                $saleData = [
                    'product_id'   => $productId,
                    'product_name' => $product['name'],
                    'quantity'     => $quantity,
                    'total_price'  => $totalPrice
                ];

                $this->sModel->insert($saleData);

                // 2. Update Stock
                $newStock = $product['stock'] - $quantity;
                $this->pModel->update($productId, ['stock' => $newStock]);

                return redirect()->to('/admin/sales')->with('success', 'Sale completed!');
---
INSERT INTO `sales` (`product_id`, `product_name`, `quantity`, `total_price`) VALUES ('13', 'Pandesal', 50, 100)
UPDATE `products` SET `stock` = 49
WHERE `products`.`id` IN ('13')
SELECT *
FROM `sales`

    public function users() {
        if (!session()->get('isLoggedIn')) return redirect()->to('/login');
        return view('admin/dashboard', ['page'=>'users', 'users'=>(new UserModel())->findAll()]);
---
SELECT *
FROM `users`