app/Controllers/AuthController.php

    public function loginAuth() {
        $session = session();
        $model = new UserModel();
        $user = $model->where('email', $this->request->getVar('email'))->first();
---
SELECT *
FROM `users`
WHERE `email` = 'admin1234@gmail.com'
 LIMIT 1