app/Controllers/DashboardController.php

SELECT *
FROM `products`
SELECT *
FROM `sales`
---
    public function index()
    {
        if ($redirect = $this->requireLogin()) {
            return $redirect;
        }

        $pModel = new ProductModel();
        $sModel = new SaleModel();
        $db     = db_connect();

        $products = $pModel->findAll();
        $sales    = $sModel->findAll();

SELECT `product_name`, SUM(quantity) AS qty
FROM `sales`
GROUP BY `product_name`
ORDER BY `qty` DESC
 LIMIT 5
---
            }
        }

        $topSellers = $db->table('sales')
            ->select('product_name, SUM(quantity) AS qty')
            ->groupBy('product_name')
            ->orderBy('qty', 'DESC')
            ->limit(5)
            ->get()
            ->getResultArray();

SELECT SUM(`total_price`) AS `rev`
FROM `sales`
WHERE `created_at` >= '2026-04-30 00:00:00'
AND `created_at` <= '2026-04-30 23:59:59'
---
            $d = date('Y-m-d', strtotime("-{$i} days"));
            $chartLabels[] = date('M j', strtotime($d));

            $row = $db->table('sales')
                ->selectSum('total_price', 'rev')
                ->where('created_at >=', $d . ' 00:00:00')
                ->where('created_at <=', $d . ' 23:59:59')
                ->get()
                ->getRowArray();

SELECT *
FROM `sales`
ORDER BY `id` DESC
 LIMIT 5
---
            'top_sellers'      => $topSellers,
            'chart_labels'     => $chartLabels,
            'chart_values'     => $chartValues,
            'recent_sales'     => $sModel->orderBy('id', 'DESC')->findAll(5),