app/Controllers/ProductController.php

SELECT *
FROM `products`
WHERE `name` LIKE '%choco flower%' ESCAPE '!'
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `products`
WHERE `name` LIKE '%choco flower%' ESCAPE '!'
---
    public function index()
    {
        if ($redirect = $this->requireLogin()) {
            return $redirect;
        }

        $q     = $this->request->getGet('q');
        $pModel = new ProductModel();

        if ($q !== null && $q !== '') {
            $pModel->like('name', $q);
        }

        return view('admin/pages/products', [
            'page'     => 'products',
            'title'    => 'Products',
            'products' => $pModel->paginate(10),