app/Controllers/ReportsController.php

SELECT SUM(`total_price`) AS `revenue`, SUM(`quantity`) AS `items`
FROM `sales`
WHERE `created_at` >= '2026-05-01 00:00:00'
AND `created_at` <= '2026-05-06 23:59:59'
---
    public function index()
    {
        if ($redirect = $this->requireLogin()) {
            return $redirect;
        }

        $from  = $this->request->getGet('from') ?: date('Y-m-01');
        $to    = $this->request->getGet('to') ?: date('Y-m-d');
        $group = $this->request->getGet('group') ?: 'day';

        $db = db_connect();

        $totals = $db->table('sales')
            ->selectSum('total_price', 'revenue')
            ->selectSum('quantity', 'items')
            ->where('created_at >=', $from . ' 00:00:00')
            ->where('created_at <=', $to . ' 23:59:59')
            ->get()
            ->getRowArray();

SELECT `product_name`, SUM(quantity) AS total_qty, SUM(total_price) AS total_rev
FROM `sales`
WHERE `created_at` >= '2026-05-01 00:00:00'
AND `created_at` <= '2026-05-06 23:59:59'
GROUP BY `product_name`
ORDER BY `total_rev` DESC
---
            [$from . ' 00:00:00', $to . ' 23:59:59']
        )->getResultArray();

        $byProduct = $db->table('sales')
            ->select('product_name, SUM(quantity) AS total_qty, SUM(total_price) AS total_rev')
            ->where('created_at >=', $from . ' 00:00:00')
            ->where('created_at <=', $to . ' 23:59:59')
            ->groupBy('product_name')
            ->orderBy('total_rev', 'DESC')
            ->get()
            ->getResultArray();