app/Controllers/SaleController.php

    public function index()
    {
        if ($redirect = $this->requireLogin()) {
            return $redirect;
        }

        $date   = $this->request->getGet('date');
        $sModel = new SaleModel();

        if ($date !== null && $date !== '') {
            $sModel->where('created_at >=', $date . ' 00:00:00')
                ->where('created_at <=', $date . ' 23:59:59');
        }

        return view('admin/pages/sales', [
            'page'      => 'sales',
            'title'     => 'Sales',
            'products'  => $this->pModel->findAll(),
            'sales'     => $sModel->orderBy('id', 'DESC')->paginate(20),
---
SELECT *
FROM `products`
SELECT *
FROM `sales`
ORDER BY `id` DESC
 LIMIT 20
SELECT COUNT(*) AS `numrows`
FROM `sales`

    public function store()
    {
        if ($redirect = $this->requireLogin()) {
            return $redirect;
        }

        $rules = [
            'product_id' => 'required|is_natural_no_zero',
            'quantity'   => 'required|integer|greater_than[0]',
        ];

        if (! $this->validate($rules)) {
            return redirect()->back()->withInput()->with('error', implode(' ', $this->validator->getErrors()));
        }

        $productId = (int) $this->request->getPost('product_id');
        $quantity  = (int) $this->request->getPost('quantity');

        $product = $this->pModel->find($productId);
        if (! $product) {
            return redirect()->to('/admin/sales')->with('error', 'Product not found.');
        }

        $unitPrice = (float) $product['price'];
        $total     = $unitPrice * $quantity;

        $db = db_connect();
        $db->transStart();

        $db->table('products')
            ->where('id', $productId)
            ->where('stock >=', $quantity)
            ->set('stock', 'stock - ' . $quantity, false)
            ->update();
---
UPDATE `products` SET `stock` = stock - 50
WHERE `id` = 24
AND `stock` >= 50

    public function delete($id)
    {
        if ($redirect = $this->requireLogin()) {
            return $redirect;
        }

        $sale = $this->sModel->find($id);
        if (! $sale) {
            return redirect()->to('/admin/sales')->with('error', 'Sale not found.');
        }

        $productId = (int) ($sale['product_id'] ?? 0);
        $quantity  = (int) ($sale['quantity'] ?? 0);

        $db = db_connect();
        $db->transStart();

        if ($productId > 0 && $quantity > 0) {
            $db->table('products')
                ->where('id', $productId)
                ->set('stock', 'stock + ' . $quantity, false)
                ->update();
        }

        $this->sModel->delete($id);
---
UPDATE `products` SET `stock` = stock + 5
WHERE `id` = 20
DELETE FROM `sales`
WHERE `id` IN ('16')