app/Controllers/StockController.php

    public function index()
    {
        if ($redirect = $this->requireLogin()) {
            return $redirect;
        }

        return view('admin/pages/stock', [
            'page'     => 'stock',
            'title'    => 'Stock',
            'products' => (new ProductModel())->findAll(),
---
SELECT *
FROM `products`