app/Controllers/UserController.php

SELECT *
FROM `users`
ORDER BY `id` ASC
---
    public function index()
    {
        if ($redirect = $this->requireLogin()) {
            return $redirect;
        }

        return view('admin/pages/users', [
            'page'  => 'users',
            'title' => 'Users',
            'users' => $this->uModel->orderBy('id', 'ASC')->findAll(),